Revit 2024 API
IntegerParameterValue Constructor (Int32)
 Value constructor
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016 Subscription Update
Syntax
C#
public IntegerParameterValue(
	int value
)
Visual Basic
Public Sub New ( _
	value As Integer _
)
Visual C++
public:
IntegerParameterValue(
	int value
)
Parameters
value
Type: System.Int32
See Also
IntegerParameterValue Class
IntegerParameterValue Overload
Autodesk.Revit.DB Namespace